Revit 2027 API
CurtainGridLine.FullCurve Property
Retrieve the geometry curve of the curtain grid line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve FullCurve { get; }
Public ReadOnly Property FullCurve As Curve
	Get
public:
property Curve^ FullCurve {
	Curve^ get ();
}
member FullCurve : Curve with get
Property Value
Curve
See Also
Reference
CurtainGridLine Class
Autodesk.Revit.DB Namespace